export type MfoOffer = {
  id: string;
  name: string;
  logo: string;
  benefits: string[];
  href: string;
  legalName: string;
  ogrn: string;
  inn: string;
  address: string;
};

export const mfoOffers: MfoOffer[] = [
  {
    "id": "zaymer",
    "name": "Займер",
    "logo": "/mfo/zaymer.svg",
    "benefits": [
      "Первый займ под 0%",
      "Деньги за 15 минут",
      "Без справок о доходах"
    ],
    "href": "https://go.leadgid.ru/aff_c?aff_id=155564&offer_id=7073&p=adnetwork",
    "legalName": "ПАО МКК «Займер»",
    "ogrn": "1235400049356",
    "inn": "5406836941",
    "address": "107078, г. Москва Орликов переулок, д.5, стр.1, этаж 2, пом.11"
  },
  {
    "id": "srochnodengi",
    "name": "Срочноденьги",
    "logo": "/mfo/srochnodengi.svg",
    "benefits": [
      "На карту любого банка",
      "Одобрение 24/7",
      "Продление онлайн"
    ],
    "href": "https://go.leadgid.ru/aff_c?aff_id=155564&offer_id=4821&p=adnetwork",
    "legalName": "ООО МКК «Срочноденьги»",
    "ogrn": "1105260001857",
    "inn": "5260271530",
    "address": "603022, Нижегородская обл., г. Нижний Новгород, ул. Тимирязева, д. 15, корп. 2, пом. 406"
  },
  {
    "id": "webbankir",
    "name": "Webbankir",
    "logo": "/mfo/webbankir.svg",
    "benefits": [
      "Деньги за несколько минут",
      "Первый заём бесплатно!",
      "Досрочное погашение без комиссий"
    ],
    "href": "",
    "legalName": "ООО МКК «ВЭББАНКИР»",
    "ogrn": "1247700626370",
    "inn": "7736364137",
    "address": "143440, Российская Федерация, Московская область, городской округ Красногорск, поселок городского типа Путилково, территория Гринвуд, строение 1, помещение 144."
  },
  {
    "id": "joymoney",
    "name": "Joymoney",
    "logo": "/mfo/joymoney.svg",
    "benefits": [
      "Деньги за несколько минут",
      "Первый заём бесплатно!",
      "Досрочное погашение без комиссий"
    ],
    "href": "",
    "legalName": "ООО МФК «Джой Мани»",
    "ogrn": "1145476064711",
    "inn": "5407496776",
    "address": "107078, г. Москва, Орликов переулок, д. 5, стр. 1, этаж 2, пом. 11."
  },
  {
    "id": "moneyman",
    "name": "Moneyman",
    "logo": "/mfo/moneyman.svg",
    "benefits": [
      "Деньги за несколько минут",
      "Первый заём бесплатно!",
      "Досрочное погашение без комиссий"
    ],
    "href": "https://go.leadgid.ru/aff_c?aff_id=155564&offer_id=5024&p=adnetwork",
    "legalName": "ООО МФК «Мани Мен»",
    "ogrn": "1117746442670",
    "inn": "7704784072",
    "address": "119017, г. Москва, Старомонетный пер., дом 3"
  },
  {
    "id": "credit7",
    "name": "Credit7",
    "logo": "/mfo/credit7.svg",
    "benefits": [
      "Деньги за несколько минут",
      "Первый заём бесплатно!",
      "Досрочное погашение без комиссий"
    ],
    "href": "https://links.inssmart.ru/offers?subId=8vs516q9iz&offerId=1514&subId1=monefy",
    "legalName": "ООО МКК «Динар»",
    "ogrn": "1247700466980",
    "inn": "9727079948",
    "address": "107140, РОССИЯ, Г.МОСКВА, ВН.ТЕР.Г. МУНИЦИПАЛЬНЫЙ ОКРУГ КРАСНОСЕЛЬСКИЙ, УЛ РУСАКОВСКАЯ, Д. 13"
  },
  {
    "id": "centrofinance",
    "name": "Центрофинанс",
    "logo": "/mfo/centrofinance.svg",
    "benefits": [
      "Деньги за несколько минут",
      "Первый заём бесплатно!",
      "Досрочное погашение без комиссий"
    ],
    "href": "",
    "legalName": "ООО МКК «ЦФГ»",
    "ogrn": "1132932001674",
    "inn": "2902076410",
    "address": "107078, г. Москва Орликов переулок, д.5, стр.1, этаж 2, пом.11"
  },
  {
    "id": "a-dengi",
    "name": "Альфа Деньги",
    "logo": "/logos/alfa.png",
    "benefits": [
      "Деньги за несколько минут",
      "Первый заём бесплатно!",
      "Досрочное погашение без комиссий"
    ],
    "href": "https://go.leadgid.ru/aff_c?aff_id=155564&offer_id=6362&p=adnetwork",
    "legalName": "ООО МКК «А ДЕНЬГИ»",
    "ogrn": "1217700636944",
    "inn": "7708400979",
    "address": "107078, г. Москва Орликов переулок, д.5, стр.1, этаж 2, пом.11"
  },
  {
    "id": "pay-ps",
    "name": "Pay P.S.",
    "logo": "/mfo/pay-ps.png",
    "benefits": [
      "Деньги за несколько минут",
      "Первый заём бесплатно!",
      "Досрочное погашение без комиссий"
    ],
    "href": "https://go.leadgid.ru/aff_c?aff_id=155564&offer_id=4412&p=adnetwork",
    "legalName": "ООО МКК «Займ Онлайн»",
    "ogrn": "1127746428171",
    "inn": "7703769314",
    "address": "107078, г. Москва, Орликов переулок, д.5, стр.1, этаж 2, пом.11"
  },
  {
    "id": "umnye-nalichnye",
    "name": "Умные наличные",
    "logo": "/mfo/umnye-nalichnye.svg",
    "benefits": [
      "Деньги за несколько минут",
      "Первый заём бесплатно!",
      "Досрочное погашение без комиссий"
    ],
    "href": "https://go.leadgid.ru/aff_c?aff_id=155564&offer_id=5562&p=adnetwork",
    "legalName": "ООО МКК «УМНЫЙ ЗАЙМ»",
    "ogrn": "1247800001756",
    "inn": "7802948882",
    "address": "125367, Москва, Полесский пр-д, д. 16, стр. 1, пом. 308"
  },
  {
    "id": "svoi-ludi",
    "name": "Свои люди",
    "logo": "/mfo/svoi-ludi.png",
    "benefits": [
      "Деньги за несколько минут",
      "Первый заём бесплатно!",
      "Досрочное погашение без комиссий"
    ],
    "href": "",
    "legalName": "ООО МКК «Свои Деньги»",
    "ogrn": "1247700487121",
    "inn": "9715488417",
    "address": "191123, Санкт-Петербург, а/я 138"
  },
  {
    "id": "maxcredit",
    "name": "MaxCredit",
    "logo": "/mfo/maxcredit.svg",
    "benefits": [
      "Деньги за несколько минут",
      "Первый заём бесплатно!",
      "Досрочное погашение без комиссий"
    ],
    "href": "https://go.leadgid.ru/aff_c?aff_id=155564&offer_id=5316&p=adnetwork",
    "legalName": "ООО МКК «М-ДЕНЬГИ»",
    "ogrn": "1237700493216",
    "inn": "9703151232",
    "address": "191187, г. Санкт-Петербург, вн.тер.г. муниципальный округ Литейный округ, ул. Шпалерная, д. 8, литера А, помещ. 16-Н, ком. 4."
  },
  {
    "id": "fastmoney",
    "name": "Fastmoney",
    "logo": "/mfo/fastmoney.svg",
    "benefits": [
      "Деньги за несколько минут",
      "Первый заём бесплатно!",
      "Досрочное погашение без комиссий"
    ],
    "href": "https://go.leadgid.ru/aff_c?aff_id=155564&offer_id=4029&p=adnetwork",
    "legalName": "ООО МКК «Фастмани.ру»",
    "ogrn": "1177847323741",
    "inn": "7805714988",
    "address": ""
  },
  {
    "id": "bystrodengi",
    "name": "Быстроденьги",
    "logo": "/mfo/bystrodengi.png",
    "benefits": [
      "Деньги за несколько минут",
      "Первый заём бесплатно!",
      "Досрочное погашение без комиссий"
    ],
    "href": "https://go.leadgid.ru/aff_c?aff_id=155564&offer_id=4464&p=adnetwork",
    "legalName": "ООО МКК Быстроденьги",
    "ogrn": "1257300005863",
    "inn": "7300044749",
    "address": "432071, г. Ульяновск, ул. Карла Маркса, д. 13А, к. 1, эт./пом. 3/5"
  },
  {
    "id": "migcredit",
    "name": "МигКредит",
    "logo": "/mfo/migcredit.svg",
    "benefits": [
      "Деньги за несколько минут",
      "Первый заём бесплатно!",
      "Досрочное погашение без комиссий"
    ],
    "href": "https://go.leadgid.ru/aff_c?aff_id=155564&offer_id=1890&p=adnetwork",
    "legalName": "ООО МФК «МигКредит»",
    "ogrn": "1107746671207",
    "inn": "7715825027",
    "address": "127015, г. Москва, вн.тер.г. муниципальный округ Бутырский, ул. Большая Новодмитровская, д. 23, стр. 3, помещ. 1/7"
  },
  {
    "id": "creditplus",
    "name": "CreditPlus",
    "logo": "/mfo/creditplus.svg",
    "benefits": [
      "Деньги за несколько минут",
      "Первый заём бесплатно!",
      "Досрочное погашение без комиссий"
    ],
    "href": "",
    "legalName": "ООО МКК «Экофинанс»",
    "ogrn": "1157746230730",
    "inn": "7715450868",
    "address": "127051, г. Москва, ул. Садовая-Самотёчная, д. 24/27, этаж 4."
  },
  {
    "id": "rocketman",
    "name": "RocketMan",
    "logo": "/mfo/rocketman.svg",
    "benefits": [
      "Деньги за несколько минут",
      "Первый заём бесплатно!",
      "Досрочное погашение без комиссий"
    ],
    "href": "",
    "legalName": "ООО МКК «Займ Бюро»",
    "ogrn": "1257700562492",
    "inn": "7716256567",
    "address": "190031, г. Санкт-Петербург, а/я 415"
  },
  {
    "id": "dengi-na-dom",
    "name": "Деньги на дом",
    "logo": "/mfo/dengi-na-dom.png",
    "benefits": [
      "Деньги за несколько минут",
      "Первый заём бесплатно!",
      "Досрочное погашение без комиссий"
    ],
    "href": "https://go.leadgid.ru/aff_c?aff_id=155564&offer_id=4970&p=adnetwork",
    "legalName": "ООО МКК «Бриз»",
    "ogrn": "1185476002117",
    "inn": "5404070027",
    "address": "119017, г. Москва, Старомонетный пер., дом 3"
  },
  {
    "id": "likezaim",
    "name": "ЛайкЗайм",
    "logo": "/mfo/likezaim.png",
    "benefits": [
      "Деньги за несколько минут",
      "Первый заём бесплатно!",
      "Досрочное погашение без комиссий"
    ],
    "href": "https://go.leadgid.ru/aff_c?aff_id=155564&offer_id=6686&p=adnetwork",
    "legalName": "ООО «Финтех-Маркет»",
    "ogrn": "",
    "inn": "6317164496",
    "address": "443001, Самарская область, г. Самара, ул. Ярмарочная, д. 3, кв. 62"
  },
  {
    "id": "dengi-srazu",
    "name": "Деньги Сразу",
    "logo": "/mfo/dengi-srazu.png",
    "benefits": [
      "Деньги за несколько минут",
      "Первый заём бесплатно!",
      "Досрочное погашение без комиссий"
    ],
    "href": "https://go.leadgid.ru/aff_c?aff_id=155564&offer_id=4759&p=adnetwork",
    "legalName": "ООО «МКК НФ»",
    "ogrn": "1166196099057",
    "inn": "6162073437",
    "address": "119017, г. Москва, Старомонетный пер., дом 3."
  },
  {
    "id": "boostra",
    "name": "Boostra",
    "logo": "/mfo/boostra.png",
    "benefits": [
      "Деньги за несколько минут",
      "Первый заём бесплатно!",
      "Досрочное погашение без комиссий"
    ],
    "href": "",
    "legalName": "ООО «Финтех-Маркет»",
    "ogrn": "1236300023849",
    "inn": "6317164496",
    "address": "443001, САМАРСКАЯ ОБЛАСТЬ, Г.О. САМАРА, ВН.Р-Н ЛЕНИНСКИЙ, Г САМАРА, УЛ ЯРМАРОЧНАЯ, Д. 3, КВ. 62"
  },
  {
    "id": "prostoy-vopros",
    "name": "Простой Вопрос",
    "logo": "/mfo/prostoy-vopros.svg",
    "benefits": [
      "Деньги за несколько минут",
      "Первый заём бесплатно!",
      "Досрочное погашение без комиссий"
    ],
    "href": "https://go.leadgid.ru/aff_c?aff_id=155564&offer_id=6467&p=adnetwork",
    "legalName": "ООО МКК «АДЕЛАИДА»",
    "ogrn": "1237800087040",
    "inn": "7838115690",
    "address": "107078, г. Москва Орликов переулок, д.5, стр.1, этаж 2, пом.11"
  },
  {
    "id": "likemoney",
    "name": "LikeMoney",
    "logo": "/mfo/likemoney.png",
    "benefits": [
      "Деньги за несколько минут",
      "Первый заём бесплатно!",
      "Досрочное погашение без комиссий"
    ],
    "href": "",
    "legalName": "ООО МКК «Лайк Мани»",
    "ogrn": "1255200003552",
    "inn": "5262398074",
    "address": "603022, Нижегородская область, г. Нижний Новгород, ул. Тимирязева, д. 15, корп. 2, помещ. П42"
  },
  {
    "id": "oneclickmoney",
    "name": "OneClickMoney",
    "logo": "/mfo/oneclickmoney.png",
    "benefits": [
      "Деньги за несколько минут",
      "Первый заём бесплатно!",
      "Досрочное погашение без комиссий"
    ],
    "href": "https://go.leadgid.ru/aff_c?aff_id=155564&offer_id=6032&p=adnetwork",
    "legalName": "АО «МКК УФ»",
    "ogrn": "1236100023433",
    "inn": "6162089317",
    "address": "119017, г. Москва, Старомонетный пер., дом 3"
  },
  {
    "id": "dobrozaim",
    "name": "Доброзайм",
    "logo": "/mfo/dobrozaim.png",
    "benefits": [
      "Деньги за несколько минут",
      "Первый заём бесплатно!",
      "Досрочное погашение без комиссий"
    ],
    "href": "https://go.leadgid.ru/aff_c?aff_id=155564&offer_id=4813&p=adnetwork",
    "legalName": "АО МФК \"Саммит\"",
    "ogrn": "1257700155360",
    "inn": "9714073258",
    "address": "123007, Москва, Хорошёвское шоссе, дом 35, корпус 1"
  }
];
